Revit 2026 API

# TaskDialogCommandLinkId Enumeration

---

Enum to specify the Id of CommandLink.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum TaskDialogCommandLinkId
```
```vb
Public Enumeration TaskDialogCommandLinkId
```
```cpp
public enum class TaskDialogCommandLinkId
```
```fsharp
type TaskDialogCommandLinkId
```

| Member name | Value | Description |
| --- | --- | --- |
| CommandLink1 | 1,001 | CommandLink1. |
| CommandLink2 | 1,002 | CommandLink2. |
| CommandLink3 | 1,003 | CommandLink3. |
| CommandLink4 | 1,004 | CommandLink4. |

#### Reference

Autodesk.Revit.UI Namespace